PinkFluffyUnic0rn/stm32flash/w25.c
#include "stm32f1xx_hal.h"
#include <stdint.h>
#include <string.h>

#include "w25.h"

#define w25fs_checksum_t uint32_t

#define W25FS_INODESECTORSCOUNT 15
#define W25FS_INODESSZ (W25_SECTORSIZE * W25FS_INODESECTORSCOUNT)
#define W25FS_INODEPERSECTOR (W25_SECTORSIZE / sizeof(struct w25fs_inode))
#define W25FS_RETRYCOUNT 5
#define W25FS_DIRSIZE (W25_SECTORSIZE - sizeof(struct w25fs_blockmeta))
#define W25FS_DIRRECORDSIZE 32
#define W25FS_ROOTINODE 0x0001000

#define _W25FS_NODATABLOCKS	0xffffff01
#define _W25FS_WRONGADDR	0xffffff02
#define _W25FS_BADDATABLOCK	0xffffff03
#define _W25FS_WRONGSIZE	0xffffff04
#define _W25FS_PATHTOOLONG	0xffffff05
#define _W25FS_INODENOTFOUND	0xffffff06
#define _W25FS_NAMENOTFOUND	0xffffff07
#define _W25FS_NOTADIR		0xffffff08
#define _W25FS_NOTAFILE		0xffffff09
#define _W25FS_NOTAFILE		0xffffff09
#define _W25FS_EDIRNOTEMPTY	0xffffff0a
#define _W25FS_EALREADYEXISTS	0xffffff0b

#define w25fs_blockgetmeta(b) (((struct w25fs_blockmeta *) (b)))
#define w25fs_uint2interr(v) (-((v) & 0xff))
#define w25fs_iserror(v) ((v) > 0xffffff00)
#define w25fs_checksumembed(buf, size) \
	w25fs_checksum((uint8_t *) (buf) + sizeof(w25fs_checksum_t), \
			(size) - sizeof(w25fs_checksum_t))
#define w25fs_checkdataembed(dev, addr, size, cs) \
	w25fs_checkdata(dev, (addr) + sizeof(w25fs_checksum_t), \
			(size) - sizeof(w25fs_checksum_t), cs)
#define min(a, b) ((a) < (b) ? (a) : (b))

struct w25fs_superblock {
	w25fs_checksum_t checksum;
	uint32_t inodecnt;
	uint32_t inodesz;
	uint32_t inodestart;
	uint32_t freeinodes;
	uint32_t blockstart;
	uint32_t freeblocks;
	uint32_t inodechecksum[W25FS_INODESECTORSCOUNT + 1];
} __attribute__((packed));

struct w25fs_inode {
	uint32_t checksum;
	uint32_t nextfree;
	uint32_t blocks;
	uint32_t size;
	uint32_t type;
	uint32_t dummy0;
	uint32_t dummy1;
	uint32_t dummy2;
} __attribute__((packed));

struct w25fs_blockmeta {
	w25fs_checksum_t checksum;
	uint32_t next;
	uint32_t datasize;
} __attribute__((packed));

const int Delay[] = {0, 10, 100, 1000, 5000};

static uint8_t Sbuf[4];
static uint8_t Rbuf[4];

static int w25_getid(struct w25fs_device *dev)
{
	Sbuf[0] = 0x9f;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(dev->hspi, Sbuf, 1, 5000);
	HAL_SPI_Receive(dev->hspi, Rbuf, 3, 5000);
	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	return ((Rbuf[0] << 16) | (Rbuf[1] << 8) | Rbuf[2]);
}

int w25_init(struct w25fs_device *dev)
{
	HAL_Delay(100);

	Sbuf[0] = 0x66;
	Sbuf[1] = 0x99;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(dev->hspi, Sbuf, 2, 5000);
	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	HAL_Delay(100);

	return w25_getid(dev);
}

static int w25_writeenable(struct w25fs_device *dev)
{
	Sbuf[0] = 0x06;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(dev->hspi, Sbuf, 1, 5000);
	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	return 0;
}

static int w25_writedisable(struct w25fs_device *dev)
{
	Sbuf[0] = 0x04;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(dev->hspi, Sbuf, 1, 5000);
	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	return 0;
}

static int w25_waitwrite(struct w25fs_device *dev)
{
	Sbuf[0] = 0x05;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);

	HAL_SPI_Transmit(dev->hspi, Sbuf, 1, 5000);

	do {
		HAL_SPI_Receive(dev->hspi, Rbuf, 1, 5000);
	} while ((Rbuf[0] & 0x01) == 0x01);

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	return 0;
}

static int w25_blockprotect(struct w25fs_device *dev, uint8_t flags)
{
	Sbuf[0] = 0x50;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(dev->hspi, Sbuf, 1, 5000);
	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	Sbuf[0] = 0x01;
	Sbuf[1] = (flags & 0x0f) << 2;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(dev->hspi, Sbuf, 2, 5000);
	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	return 0;
}

int w25_initdevice(struct w25fs_device *dev, SPI_HandleTypeDef *hspi,
	GPIO_TypeDef *gpio, uint16_t pin)
{
	dev->hspi = hspi;
	dev->gpio = gpio;
	dev->pin = pin;

	return 0;
}

int w25_read(struct w25fs_device *dev, uint32_t addr, uint8_t *data,
	uint32_t sz)
{
	Sbuf[0] = 0x03;
	Sbuf[1] = (addr >> 16) & 0xff;
	Sbuf[2] = (addr >> 8) & 0xff;
	Sbuf[3] = addr & 0xff;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(dev->hspi, Sbuf, 4, 5000);
	HAL_SPI_Receive(dev->hspi, data, sz, 5000);
	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	return 0;
}

int w25_write(struct w25fs_device *dev, uint32_t addr,
	const uint8_t *data, uint32_t sz)
{
	w25_waitwrite(dev);

	w25_blockprotect(dev, 0x00);
	w25_writeenable(dev);

	Sbuf[0] = 0x02;
	Sbuf[1] = (addr >> 16) & 0xff;
	Sbuf[2] = (addr >> 8) & 0xff;
	Sbuf[3] = addr & 0xff;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(dev->hspi, Sbuf, 4, 5000);
	HAL_SPI_Transmit(dev->hspi, (uint8_t  *) data, sz, 5000);
	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	w25_waitwrite(dev);
	w25_writedisable(dev);
	w25_blockprotect(dev, 0x0f);

	return 0;
}

int w25_eraseall(struct w25fs_device *dev)
{
	w25_waitwrite(dev);
	w25_blockprotect(dev, 0x00);
	w25_writeenable(dev);

	Sbuf[0] = 0xc7;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(dev->hspi, Sbuf, 1, 5000);
	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	w25_waitwrite(dev);
	w25_writedisable(dev);
	w25_blockprotect(dev, 0x0f);

	return 0;
}

int w25_erasesector(struct w25fs_device *dev, uint32_t addr)
{
	w25_waitwrite(dev);
	w25_blockprotect(dev, 0x00);
	w25_writeenable(dev);

	Sbuf[0] = 0x20;
	Sbuf[1] = (addr >> 16) & 0xff;
	Sbuf[2] = (addr >> 8) & 0xff;
	Sbuf[3] = addr & 0xff;

	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(dev->hspi, Sbuf, 4, 5000);
	HAL_GPIO_WritePin(dev->gpio, dev->pin, GPIO_PIN_SET);

	w25_waitwrite(dev);
	w25_writedisable(dev);
	w25_blockprotect(dev, 0x0f);

