PinkFluffyUnic0rn/stm32flash/w25.c
	toks[i++] = strtok(pathbuf, "/");

	while (i < sz && (toks[i++] = strtok(NULL, "/")) != NULL);

	--i;

	if (i >= sz)
		return _W25FS_PATHTOOLONG;

	if (toks[0] == NULL)
		return 0;

	return i;
}

static uint32_t w25fs_dirfindinode(uint8_t *buf, uint32_t n)
{
	uint32_t offset;

	for (offset = 0; ; offset += W25FS_DIRRECORDSIZE) {
		uint32_t nn;

		nn = 0xffffffff;

		memmove(&nn, buf + offset, sizeof(uint32_t));

		if (nn == n)
			return offset;
	}

	return _W25FS_INODENOTFOUND;
}

static uint32_t w25fs_dirsearch(uint8_t *buf, const char *name)
{
	uint32_t offset;

	for (offset = 0; ; offset += W25FS_DIRRECORDSIZE) {
		uint32_t n;

		n = 0xffffffff;

		memmove(&n, buf + offset, sizeof(uint32_t));

		if (n == 0xffffffff)
			return _W25FS_NAMENOTFOUND;

		if (strcmp((char *) buf + offset
				+ sizeof(uint32_t), name) == 0) {
			return n;
		}
	}

	return _W25FS_NAMENOTFOUND;
}

uint32_t w25fs_dirgetinode(struct w25fs_device *dev, const char **path)
{
	struct w25fs_superblock sb;
	uint8_t buf[W25FS_DIRSIZE];
	uint32_t parn;
	const char **p;

	w25fs_readsuperblock(dev, &sb);

	parn = W25FS_ROOTINODE;

	for (p = path; *p != NULL; ++p) {
		struct w25fs_inode in;

		w25fs_readinode(dev, (&in), parn, &sb);

		if (in.type != W25FS_DIR)
			return _W25FS_NOTADIR;

		w25fs_inodeget(dev, parn, buf, W25FS_DIRSIZE);

		if (w25fs_iserror(parn = w25fs_dirsearch(buf, *p)))
			return _W25FS_NAMENOTFOUND;
	}

	return parn;
}

static int w25fs_diradd(struct w25fs_device *dev, uint32_t parn,
	const char *name, uint32_t n)
{
	uint8_t buf[W25FS_DIRSIZE];
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t offset, r, b;

	w25fs_readsuperblock(dev, &sb);
	w25fs_readinode(dev, &in, parn, &sb);

	if (in.type != W25FS_DIR)
		return W25FS_ENOTADIR;

	r = w25fs_inodeget(dev, parn, buf, W25FS_DIRSIZE);
	if (w25fs_iserror(r))
		return w25fs_uint2interr(r);	

	offset = w25fs_dirfindinode(buf, 0xffffffff);

	memmove(buf + offset, (uint8_t *) &n, sizeof(uint32_t));
	strcpy((char *) buf + offset + sizeof(uint32_t), name);

	b = 0xffffffff;
	memmove(buf + offset + W25FS_DIRRECORDSIZE,
		(uint8_t *) &b, sizeof(uint32_t));

	if ((w25fs_iserror(parn = w25fs_inodeset(dev, parn, buf,
			W25FS_DIRSIZE)))) {
		return w25fs_uint2interr(r);
	}

	return 0;
}

static int w25fs_dirdeleteinode(struct w25fs_device *dev,
	uint32_t parn, uint32_t n)
{
	uint8_t buf[W25FS_DIRSIZE];
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t offset, last, r, b;

	w25fs_readsuperblock(dev, &sb);
	w25fs_readinode(dev, &in, parn, &sb);

	if (in.type != W25FS_DIR)
		return W25FS_ENOTADIR;

	r = w25fs_inodeget(dev, parn, buf, W25FS_DIRSIZE);
	if (w25fs_iserror(r))
		return w25fs_uint2interr(r);

	last = w25fs_dirfindinode(buf, 0xffffffff);
	if (last == 0)
		return (-1);

	if (last != W25FS_DIRRECORDSIZE)
		last -= W25FS_DIRRECORDSIZE;

	offset = w25fs_dirfindinode(buf, n);

	memmove(buf + offset, buf + last, W25FS_DIRRECORDSIZE);

	b = 0xffffffff;
	memmove(buf + last, (uint8_t *) &b, sizeof(uint32_t));

	w25fs_inodeset(dev, parn, buf, W25FS_DIRSIZE);

	return 0;
}

static int w25fs_dirisempty(struct w25fs_device *dev, uint32_t n)
{
	uint8_t buf[W25FS_DIRSIZE];
	uint32_t r, nn;

	if (w25fs_iserror(r = w25fs_inodeget(dev, n, buf, W25FS_DIRSIZE)))	
		return w25fs_uint2interr(r);

	memmove(&nn, buf, sizeof(uint32_t));

	return ((nn != 0xffffffff) ? W25FS_EDIRNOTEMPTY : 0);
}

static int _w25fs_dirlist(struct w25fs_device *dev, uint32_t n,
	char *lbuf, size_t sz)
{
	uint8_t buf[W25FS_DIRSIZE];
	uint32_t offset, r;

	if (w25fs_iserror(r = w25fs_inodeget(dev, n, buf, W25FS_DIRSIZE)))	
		return w25fs_uint2interr(r);

	lbuf[0] = '\0';
	for (offset = 0; ; offset += W25FS_DIRRECORDSIZE) {
		uint32_t nn;

		nn = 0xffffffff;

		memmove(&nn, buf + offset, sizeof(uint32_t));

		if (nn == 0xffffffff)
			break;

		strcat(lbuf, (char *) buf + offset + sizeof(uint32_t));
		strcat(lbuf, "\n\r");
	}

	return 0;
}

int w25fs_init(struct w25fs_device *dev)
{
	w25_init(dev);

	return 0;
}

int w25fs_dircreate(struct w25fs_device *dev, const char *path)
{
	const char *toks[W25FS_PATHMAX];
	const char *fname;
	uint32_t parn, n, b;
	int tokc;

	tokc = w25fs_splitpath(path, toks, W25FS_PATHMAX);

	if (tokc != 0 && w25fs_dirgetinode(dev, toks)
			!= _W25FS_NAMENOTFOUND) {
		return W25FS_EALREADYEXISTS;
	}

	n = w25fs_inodecreate(dev, W25FS_DIRSIZE, W25FS_DIR);
	if (w25fs_iserror(n))
		return w25fs_uint2interr(n);

	b = 0xffffffff;
	w25fs_inodeset(dev, n, (uint8_t *) &b, sizeof(uint32_t));

	if (tokc == 0)
		return 0;

	fname = toks[tokc - 1];
	toks[tokc - 1] = NULL;

	if (w25fs_iserror(parn = w25fs_dirgetinode(dev, toks)))
		return w25fs_uint2interr(parn);

	return w25fs_diradd(dev, parn, fname, n);
}

int w25fs_dirdelete(struct w25fs_device *dev, const char *path)
{
	const char *toks[W25FS_PATHMAX];
	uint32_t parn, n;
	int tokc, r;

	tokc = w25fs_splitpath(path, toks, W25FS_PATHMAX);

	if (w25fs_iserror(n = w25fs_dirgetinode(dev, toks)))
		return w25fs_uint2interr(n);

	if ((r = w25fs_dirisempty(dev, n)) < 0)
		return r;

	toks[tokc - 1] = NULL;

	if (w25fs_iserror(parn = w25fs_dirgetinode(dev, toks)))
		return w25fs_uint2interr(parn);

	if ((r = w25fs_dirdeleteinode(dev, parn, n)) < 0)
		return r;

	if (w25fs_iserror(n = w25fs_inodedelete(dev, n)))
		return w25fs_uint2interr(parn);

	return 0;
}

int w25fs_dirlist(struct w25fs_device *dev, const char *path,
	char *lbuf, size_t sz)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	const char *toks[W25FS_PATHMAX];
	uint32_t n;

	w25fs_splitpath(path, toks, W25FS_PATHMAX);

	if (w25fs_iserror(n = w25fs_dirgetinode(dev, toks)))
		return w25fs_uint2interr(n);

	w25fs_readsuperblock(dev, &sb);
	w25fs_readinode(dev, &in, n, &sb);

	if (in.type != W25FS_DIR)
		return W25FS_ENOTADIR;

	return _w25fs_dirlist(dev, n, lbuf, sz);
}

int w25fs_filewrite(struct w25fs_device *dev, const char *path,
	const char *buf, size_t sz)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	const char *toks[W25FS_PATHMAX];
	uint32_t n, r;

	w25fs_splitpath(path, toks, W25FS_PATHMAX);

