PinkFluffyUnic0rn/stm32flash/w25.c
	if (w25fs_iserror(n = w25fs_dirgetinode(dev, toks)))
		return w25fs_uint2interr(n);

	w25fs_readsuperblock(dev, &sb);
	w25fs_readinode(dev, &in, n, &sb);

	in.type = W25FS_FILE;
	in.size = sz;

	if (w25fs_iserror(r = w25fs_deletedatablock(dev, in.blocks, &sb)))
		return w25fs_uint2interr(r);

	in.blocks = w25fs_createdatablock(dev, &sb, sz);
	if (w25fs_iserror(in.blocks))
		return w25fs_uint2interr(in.blocks);

	w25fs_writeinode(dev, &in, n, &sb);
	w25fs_writesuperblock(dev, &sb);

	if (w25fs_iserror(n = w25fs_inodeset(dev, n, (uint8_t *) buf, sz)))
		return w25fs_uint2interr(n);

	return 0;
}

int w25fs_fileread(struct w25fs_device *dev, const char *path,
	char *buf, size_t sz)
{
	const char *toks[W25FS_PATHMAX];
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	uint32_t n;

	w25fs_splitpath(path, toks, W25FS_PATHMAX);

	if (w25fs_iserror(n = w25fs_dirgetinode(dev, toks)))
		return w25fs_uint2interr(n);

	w25fs_readsuperblock(dev, &sb);
	w25fs_readinode(dev, &in, n, &sb);

	if (in.type != W25FS_FILE)
		return W25FS_ENOTAFILE;

	if (w25fs_iserror(n = w25fs_inodeget(dev, n, (uint8_t *) buf, sz)))
		return w25fs_uint2interr(n);

	return 0;
}

int w25fs_dirstat(struct w25fs_device *dev, const char *path,
	struct w25fs_dirstat *st)
{
	struct w25fs_superblock sb;
	struct w25fs_inode in;
	const char *toks[W25FS_PATHMAX];
	uint32_t n;
	int r;

	if ((r = w25fs_splitpath(path, toks, W25FS_PATHMAX)) < 0)
		return r;

	if (w25fs_iserror(n = w25fs_dirgetinode(dev, toks)))
		return w25fs_uint2interr(n);

	w25fs_readsuperblock(dev, &sb);
	w25fs_readinode(dev, &in, n, &sb);

	st->size = in.size;
	st->type = in.type;

	return 0;
}

const char *w25fs_strfiletype(enum W25FS_INODETYPE type)
{
	char *W25FS_FILETYPE[] = {
		"empty", "file", "device", "directory"
	};

	return W25FS_FILETYPE[type];
}

const char *w25fs_strerror(enum W25FS_ERROR e)
{
	char *strerror[] = {
		"success",
		"run out of data blocks",
		"wrong address",
		"bad data block",
		"wrong size",
		"path is too long",
		"inode not found",
		"path not found",
		"not a directory",
		"not a regular file",
		"directory is not empty",
		"directory already exists"
	};

	return strerror[-e];
}
